app/views/terminos/_form.html.erb

SELECT "categorias".* FROM "categorias"
---
    <%= f.label "Categoria a la que pertenece el Termino"  %>
    <%= f.collection_select(:categoria_id,Categoria.all, :id, :nombre) %><br />

SELECT "users".* FROM "users"
---
    <%= f.label "Usuario que lo crea" %>
    <%= f.collection_select(:user_id,User.all, :id, :name) %><br />