app/controllers/categorias_controller.rb

  def index
    @categorias = Categoria.all
---
SELECT "categorias".* FROM "categorias"