app/controllers/home_controller.rb

  def buscar
  	@nombre=params[:q].downcase  #pasa a minuscula el parametro de la busqueda
    encontro=false

  	if (@nombre!="")

         @nombre=@nombre.mb_chars.decompose.scan(/[a-zA-Z0-9]/).join
  	 	   @terminos=Termino.where("lower(nombre)like ?", "%#{@nombre}%" )
---
SELECT "terminos".* FROM "terminos" WHERE (lower(nombre)like '%a%')